{
    "home": {
        "title": "Home",
        "welcome": "Hello, I'm Jonathan Robinson",
        "desc": "A passionate web and game developer, driven by a lifelong fascination with technology and the thrill of problem-solving. I find immense joy in creating intuitive, dynamic user experiences and captivating game environments."
    },
    "about": {
        "title": "About me",
        "para1": "I am a web and game developer based in the Greater Toronto Area. I have a passion for creating intuitive, dynamic user experiences and captivating game environments. I am a graduate of the Game Development program at George Brown College, and I am currently working as a freelance web developer.",
        "para2": "I am a lifelong learner, and I am always looking for new opportunities to expand my skillset. I am currently learning React, and I am looking forward to learning more about the MERN stack.",
        "para3": "When I'm not coding, I enjoy playing video games, reading, and spending time with my family.",
        "skills": "Skills",
        "showPics": "Show some of my pictures",
        "hidePics": "Hide my pictures"
    },
    "projects": {
        "title": "Projects",
        "tls": {
            "title": "The Last Stand",
            "desc": "Proof of concept for a multiplayer smashlike game"
        },
        "boids": {
            "desc": "A Boids program that uses steering behaviors to simulate flocking movement."
        },
        "magix": {
            "desc": "A multiplayer card game, akin to Hearthstone, that interfaces with a database and a server's API to retrieve and display the game's current state."
        },
        "textanalyzer": {
            "title": "Text Analyzer",
            "desc": "Program that analyzes text and searches for synonyms."
        },
        "fsm": {
            "title": "Finite State Machine",
            "desc": "A finite state machine that can be used to control a GoPiGo3 robot."
        },
        "ga": {
            "title": "Genetic Algorithm",
            "desc": "A genetic algorithm used to provide different solutions to common problems"
        },
        "paint":{
            "desc": "A paint program that allows the user to draw on a canvas anf other simple things."
        },
        "playerspotify": {
            "title": "Radiohead Player",
            "desc": "A program that allows the user to play Radiohead playlists using the spotify API."
        },
        "quizspotify": {
            "title": "Spotify Quiz",
            "desc": "A program that allows the user to play a quiz game using the spotify API."
        },
        "portfolio": {
            "title": "Portfolio",
            "desc": "This website, a portfolio for Jonathan Robinson."
        }
        
    },
    "services": {
        "title": "Services",
        "desc": "Services page for Jonathan Robinson's portfolio website"
    },
    "contact": {
        "title": "Contact",
        "nameInput": {
            "label": "Name",
            "ariaLabel": "Name",
            "placeholder": "Enter your name"
        },
        "emailInput": {
            "label": "Email",
            "arialabel": "Email",
            "placeholder": "Enter your email"
        },
        "messageInput": {
            "label": "Message",
            "ariaLabel": "Message",
            "placeholder": "Enter your message"
        }
    },
    "notifications": {
        "verifyEmail": {
            "success": {
                "title": "Success",
                "message": "Email verified successfully"
            },
            "pendinglink": {
                "title": "Pending link",
                "message": "Your Email address has a pending verifying token, please check your emails."
            },
            "notverified": {
                "title": "Please verify your email",
                "message": "A link will be sent to your address when you press the button"
            }
        },
        "submit": {
            "loading": {
                "title": "Loading",
                "message": "Sending email"
            },
            "success": {
                "title": "Success",
                "message": "Email sent successfully."
            },
            "error": {
                "title": "Error",
                "message": "Email failed to send, please try again later."
            }
        },
        "sendConfirmation": {
            "linkSent": {
                "title": "Link sent...",
                "message": "Please click the link in your emails..."
            },
            "error": {
                "title": "Error",
                "message": "The confirmation email could not get through"
            }
        }
    },
    "confirmationEmail": {
        "subject": "Thanks for contacting me, please confirm your email address",
        "text": "Greetings {{userName}}, \n\nThanks for contacting me, please confirm your email address by clicking the link below:\n\n{{link}}\n\nYour email address will be kept for 6 months after your confirmation, the expiration resets at every new daily mail.\n\nIf you did not request this email, please ignore it.\n\nThanks,\nJonathan Robinson"
    },
    "thankyouEmail": {
        "subject": "{{name}}, I have received your message",
        "text": "Greetings {{name}}, \n\nThanks for contacting me, I will get back to you as soon as possible.\n\nThanks,\nJonathan Robinson"
    },
    "common": {
        "viewcode": "View Code",
        "viewdemo": "View Demo",
        "showmore": "Show More",
        "showless": "Show Less",
        "sendlink": "Send Link",
        "sending": "Sending...",
        "send": "Send",
        "traveler": "Traveler"
    }
}