{
    "home": {
        "title": "Inicio",
        "welcome": "Hola, soy Jonathan Robinson",
        "desc": "Un entusiasta apasionado de la informática, impulsado por una fascinación de toda la vida por la tecnología y el entusiasmo de resolver problemas. Actualmente busco oportunidades para sumergirme y hacer una contribución activa al mundo de la tecnología."
    },
    "about": {
        "title": "Acerca de",
        "para1": "Habiendo trabajado durante varios años en logística y transporte, particularmente como conductor de carretilla elevadora, he cultivado un rigor y atención al detalle que me ha permitido destacar en todo lo que emprendo. Mis experiencias anteriores me dotaron de habilidades esenciales de trabajo en equipo y comunicación, elementos clave para el éxito en cualquier campo..",
        "para2": "Ahora, en mis treinta años y recién graduado en informática, estoy ansioso por aprovechar mi sólida base de habilidades y mi pasión por la tecnología en la industria digital. Aunque mi trayectoria pueda parecer poco convencional, creo firmemente que mis experiencias pasadas me ofrecen una perspectiva única y valiosa. Como padre comprometido, estoy impulsado por el deseo de ofrecer lo mejor para mi familia, lo cual se refleja en mi compromiso profesional donde siempre busco superar las expectativas.",
        "para3": "El mundo de la informática siempre me ha fascinado con sus infinitas posibilidades y las innovaciones que aporta. Estoy convencido de que los desafíos que he enfrentado y las habilidades que he adquirido en el pasado me preparan de manera ideal para una carrera exitosa en la tecnología. Actualmente busco oportunidades para sumergirme y hacer una contribución activa al mundo de la tecnología.",
        "skills": "Tecnologías que utilizo",
        "showPics": "Mostrar unas imágenes de yo",
        "hidePics": "Ocultar imágenes"
    },
    "projects": {
        "title": "Proyectos",
        "tls": {
            "title": "The Last Stand",
            "desc": "Prueba de concepto para un juego estilo Smash multijugador"
        },
        "boids": {
            "desc": "Un programa Boids que utiliza comportamientos de dirección para simular el movimiento de agrupación."
        },
        "magix": {
            "desc": "Un juego de cartas multijugador similar a Hearthstone que se conecta a una base de datos y a la API de un servidor para obtener y mostrar el estado actual del juego."
        },
        "textanalyzer": {
            "title": "Analizador de texto",
            "desc": "Programa que analiza texto y busca sinónimos."
        },
        "fsm": {
            "title": "Máquina de estados finitos",
            "desc": "Una máquina de estados finitos que puede ser utilizada para controlar un robot GoPiGo3."
        },
        "ga": {
            "title": "Algoritmo genético",
            "desc": "Un algoritmo genético usado para proporcionar diferentes soluciones a problemas comunes"
        },
        "paint": {
            "desc": "Un programa de pintura que permite al usuario dibujar en un lienzo y otras cosas simples."
        },
        "playerspotify": {
            "title": "Reproductor de Radiohead",
            "desc": "Un programa que permite al usuario reproducir listas de reproducción de Radiohead utilizando la API de Spotify."
        },
        "quizspotify": {
            "title": "Trivia de Muscia",
            "desc": "Un programa que permite al usuario jugar un juego de trivia utilizando la API de Spotify."
        },
        "portfolio": {
            "title": "Portafolio",
            "desc": "Este sitio web, un portafolio para Jonathan Robinson."
        }
    },
    "services": {
        "title": "Servicios",
        "desc": "Página de servicios para el portafolio de Jonathan Robinson"
    },
    "contact": {
        "title": "Contacto",
        "nameInput": {
            "label": "Nombre",
            "arialabel": "Nombre",
            "placeholder": "Nombre"
        },
        "emailInput": {
            "label": "Correo electrónico",
            "ariaLabel": "Correo electrónico",
            "placeholder": "Correo electrónico"
        },
        "messageInput": {
            "label": "Mensaje",
            "ariaLabel": "Mensaje",
            "placeholder": "Mensaje"
        }
    },
    "notifications": {
        "verifyEmail": {
            "success": {
                "title": "Éxito",
                "message": "Email verificado con éxito"
            },
            "pendinglink": {
                "title": "Enlace pendiente",
                "message": "Su dirección de correo electrónico tiene un token de verificación pendiente, por favor revise sus correos electrónicos."
            },
            "notverified": {
                "title": "Por favor verifique su correo electrónico",
                "message": "Se enviará un enlace a su dirección cuando presione el botón"
            }
        },
        "submit": {
            "loading": {
                "title": "Cargando",
                "message": "Enviando email"
            },
            "success": {
                "title": "Éxito",
                "message": "Email enviado con éxito."
            },
            "error": {
                "title": "Error",
                "message": "El envío del email ha fallado, por favor intente nuevamente más tarde."
            }
        },
        "sendConfirmation": {
            "linkSent": {
                "title": "Enlace enviado...",
                "message": "Por favor haga clic en el enlace en sus correos electrónicos..."
            },
            "error": {
                "title": "Error",
                "message": "El correo electrónico de confirmación no pudo ser enviado"
            }
        }
    },
    "confirmationEmail": {
        "subject": "Gracias para contactarme, por favor confirme su correo electrónico",
        "text": "Hola, {{userName}} \n\nGracias para contactarme. Por favor confirme su correo electrónico haciendo clic en el enlace de abajo:\n\n{{link}}\n\nPor favor, ten en cuenta que su dirección de correo electrónico se guardará durante 6 meses, renovándose la fecha de vencimiento con cada nuevo correo electrónico en un día determinado\n\nSi no ha enviado este correo electrónico, por favor ignore este mensaje.\n\nGracias,\nJonathan Robinson"
    },
    "thankyouEmail": {
        "subject": "{{name}}, gracias por contactarme",
        "text": "Hola, {{name}} \n\nGracias por contactarme. Su correo electrónico ha sido recibido y será respondido lo antes posible.\n\nGracias,\nJonathan Robinson"
    },
    "common": {
        "viewcode": "Ver código",
        "viewdemo": "Ver demostración",
        "showmore": "Mostrar más",
        "showless": "Mostrar menos",
        "sendlink": "Enviar enlace",
        "sending": "Enviando...",
        "send": "Enviar",
        "traveler": "Viajero"
    }
}