{
    "home": {
        "title": "Accueil",
        "welcome": "Bonjour, je m'appelle Jonathan Robinson",
        "desc": "Un passionné d'informatique, animé par une fascination de toujours pour la technologie et l'excitation de la résolution de problèmes. Je cherche actuellement des opportunités pour m'immerger et apporter une contribution active au monde de la technologie."
    },
    "about": {
        "title": "À propos",
        "para1": "Ayant travaillé pendant plusieurs années dans les domaines de la manutention et du transport, notamment en tant que conducteur de chariot élévateur, j'ai cultivé une rigueur et une attention aux détails qui m'ont permis d'exceller dans tout ce que j'entreprends. Mes précédentes expériences m'ont également permis de développer des compétences essentielles en matière de travail d'équipe et de communication, éléments clés pour réussir dans n'importe quel domaine.",
        "para2": "Maintenant dans la trentaine et récemment diplômé en informatique, je suis enthousiaste à l'idée de mettre à profit ma solide base de compétences et ma passion pour la technologie dans l'industrie du numérique. Bien que mon parcours puisse sembler atypique, je crois fermement que mes expériences antérieures me fournissent une perspective unique et précieuse. En tant que père dévoué, je suis animé par le désir de fournir le meilleur pour ma famille, ce qui se reflète dans mon engagement professionnel où je m'efforce toujours de dépasser les attentes.",
        "para3": "L'univers de l'informatique m'a toujours fasciné par ses innombrables possibilités et les innovations qu'il apporte. Je suis convaincu que les défis auxquels j'ai été confronté et les compétences que j'ai acquises dans le passé me préparent idéalement pour une carrière fructueuse dans le tech. Je recherche actuellement des opportunités pour me lancer et contribuer activement au monde de la technologie.",
        "skills": "Technologies que j'utilise",
        "showPics": "Voir quelques photos de moi",
        "hidePics": "Cacher les photos"
    },
    "projects": {
        "title": "Projets",
        "tls": {
            "title": "The Last Stand",
            "desc": "Preuve de concept pour un jeu multijoueur de type Smash"
        },
        "boids": {
            "desc": "Un programme Boids utilisant des comportements de pilotage pour simuler le mouvement de groupement."
        },
        "magix": {
            "desc": "Un jeu de cartes multijoueur similaire à Hearthstone qui se connecte à une base de données et à l'API d'un serveur pour récupérer et afficher l'état actuel du jeu."
        },
        "textanalyzer": {
            "title": "Analyseur de texte",
            "desc": "Programme qui analyse du texte et recherche des synonymes"
        },
        "fsm": {
            "title": "Machine à états finis",
            "desc": "Une machine à états finis qui peut être utilisée pour contrôler un robot GoPiGo3."
        },
        "ga": {
            "title": "Algorithme génétique",
            "desc": "Un algorithme génétique utilisé pour fournir différentes solutions aux problèmes courants"
        },
        "paint": {
            "desc": "Un programme de dessin qui permet à l'utilisateur de dessiner sur une toile et d'autres choses simples."
        },
        "playerspotify": {
            "title": "Lecteur Radiohead",
            "desc": "Un programme qui permet à l'utilisateur de jouer des playlists de Radiohead en utilisant l'API Spotify."
        },
        "quizspotify": {
            "title": "Quiz Spotify",
            "desc": "Un programme qui permet à l'utilisateur de jouer à un jeu quiz en utilisant l'API Spotify."
        },
        "portfolio": {
            "title": "Portfolio",
            "desc": "Ce site web, un portfolio pour Jonathan Robinson."
        }
    },
    "services": {
        "title": "Services",
        "desc": "Page des services pour le portfolio de Jonathan Robinson"
    },
    "contact": {
        "title": "Contact",
        "nameInput": {
            "label": "Nom",
            "ariaLabel": "Nom",
            "placeholder": "Entrez votre nom"
        },
        "emailInput": {
            "label": "Courriel",
            "arialabel": "Courriel",
            "placeholder": "Entrez votre courriel"
        },
        "messageInput": {
            "label": "Message",
            "ariaLabel": "Message",
            "placeholder": "Entrez votre message"
        }
    },
    "notifications": {
        "verifyEmail": {
            "success": {
                "title": "Succès",
                "message": "Email vérifié avec succès"
            },
            "pendinglink": {
                "title": "Lien en attente",
                "message": "Votre adresse e-mail a un token de vérification en attente, veuillez vérifier vos e-mails."
            },
            "notverified": {
                "title": "Veuillez vérifier votre email",
                "message": "Un lien vous sera envoyé lorsque vous appuierez sur le bouton"
            }
        },
        "submit": {
            "loading": {
                "title": "Chargement",
                "message": "Envoi de l'email"
            },
            "success": {
                "title": "Succès",
                "message": "Email envoyé avec succès."
            },
            "error": {
                "title": "Erreur",
                "message": "L'envoi de l'email a échoué, veuillez réessayer plus tard."
            }
        },
        "sendConfirmation": {
            "linkSent": {
                "title": "Lien envoyé...",
                "message": "Veuillez cliquer sur le lien dans vos e-mails..."
            },
            "error": {
                "title": "Erreur",
                "message": "L'email de confirmation n'a pas pu être envoyé"
            }
        }
    },
    "confirmationEmail": {
        "subject": "Merci de m'avoir contacté, veuillez confirmer votre adresse courriel",
        "text": "Bonjour, {{userName}} \n\nMerci de m'avoir contacté, veuillez confirmer votre adresse courriel en cliquant sur le lien ci-dessous:\n\n{{link}}\n\nVeuillez noter que votre adresse courriel sera retenue 6 mois, la date d'expiration se renouvelant à chaque nouveau courriel d'une journée donnée\n\nSi vous n'avez pas demandé à être contacté, veuillez ignorer cet e-mail.\n\nCordialement,\nJonathan Robinson"
    },
    "thankyouEmail": {
        "subject": "{{name}}, j'ai bien reçu votre message",
        "text": "Bonjour {{name}},\n\nMerci de m'avoir contacté, j'ai bien reçu votre message et je vous répondrai dès que possible.\n\nCordialement,\nJonathan Robinson"
    },
    "common": {
        "viewcode": "Voir le code",
        "viewdemo": "Voir la démo",
        "showmore": "Voir plus",
        "showless": "Voir moins",
        "sendlink": "J'accepte",
        "sending": "Envoi...",
        "send": "Envoyer",
        "traveler": "Voyageur"
    }
}